{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.1.2", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_8", "layers": [{"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Conv1D", "config": {"name": "conv1d", "trainable": true, "batch_input_shape": [null, null, 64], "dtype": "float32", "filters": 256, "kernel_size": [11], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu", "trainable": true, "dtype": "float32", "max_value": 20.0, "negative_slope": 0.0, "threshold": 0.0}}]}}, {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "batch_input_shape": [null, null, 256], "dtype": "float32", "filters": 256, "kernel_size": [11], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_1", "trainable": true, "dtype": "float32", "max_value": 20.0, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "batch_input_shape": [null, null, 256], "dtype": "float32", "filters": 256, "kernel_size": [11], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_2", "trainable": true, "dtype": "float32", "max_value": 20.0, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "Conv1D", "config": {"name": "conv1d_3", "trainable": true, "batch_input_shape": [null, null, 256], "dtype": "float32", "filters": 256, "kernel_size": [11], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_3", "trainable": true, "dtype": "float32", "max_value": 20.0, "negative_slope": 0.0, "threshold": 0.0}}]}}, {"class_name": "Sequential", "config": {"name": "sequential_2", "layers": [{"class_name": "Conv1D", "config": {"name": "conv1d_4", "trainable": true, "batch_input_shape": [null, null, 256], "dtype": "float32", "filters": 384, "kernel_size": [13], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_4", "trainable": true, "dtype": "float32", "max_value": 20.0, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "Conv1D", "config": {"name": "conv1d_5", "trainable": true, "batch_input_shape": [null, null, 384], "dtype": "float32", "filters": 384, "kernel_size": [13], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_5", "trainable": true, "dtype": "float32", "max_value": 20.0, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "Conv1D", "config": {"name": "conv1d_6", "trainable": true, "batch_input_shape": [null, null, 384], "dtype": "float32", "filters": 384, "kernel_size": [13], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_6", "trainable": true, "dtype": "float32", "max_value": 20.0, "negative_slope": 0.0, "threshold": 0.0}}]}}, {"class_name": "Sequential", "config": {"name": "sequential_3", "layers": [{"class_name": "Conv1D", "config": {"name": "conv1d_7", "trainable": true, "batch_input_shape": [null, null, 384], "dtype": "float32", "filters": 512, "kernel_size": [17], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_7", "trainable": true, "dtype": "float32", "max_value": 20.0, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "Conv1D", "config": {"name": "conv1d_8", "trainable": true, "batch_input_shape": [null, null, 512], "dtype": "float32", "filters": 512, "kernel_size": [17], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_8", "trainable": true, "dtype": "float32", "max_value": 20.0, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "Conv1D", "config": {"name": "conv1d_9", "trainable": true, "batch_input_shape": [null, null, 512], "dtype": "float32", "filters": 512, "kernel_size": [17], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_9", "trainable": true, "dtype": "float32", "max_value": 20.0, "negative_slope": 0.0, "threshold": 0.0}}]}}, {"class_name": "Sequential", "config": {"name": "sequential_4", "layers": [{"class_name": "Conv1D", "config": {"name": "conv1d_10", "trainable": true, "batch_input_shape": [null, null, 512], "dtype": "float32", "filters": 640, "kernel_size": [21], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_10", "trainable": true, "dtype": "float32", "max_value": 20.0, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "Conv1D", "config": {"name": "conv1d_11", "trainable": true, "batch_input_shape": [null, null, 640], "dtype": "float32", "filters": 640, "kernel_size": [21], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_11", "trainable": true, "dtype": "float32", "max_value": 20.0, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "Conv1D", "config": {"name": "conv1d_12", "trainable": true, "batch_input_shape": [null, null, 640], "dtype": "float32", "filters": 640, "kernel_size": [21], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_12", "trainable": true, "dtype": "float32", "max_value": 20.0, "negative_slope": 0.0, "threshold": 0.0}}]}}, {"class_name": "Sequential", "config": {"name": "sequential_5", "layers": [{"class_name": "Conv1D", "config": {"name": "conv1d_13", "trainable": true, "batch_input_shape": [null, null, 640], "dtype": "float32", "filters": 768, "kernel_size": [25], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_13", "trainable": true, "dtype": "float32", "max_value": 20.0, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "Conv1D", "config": {"name": "conv1d_14", "trainable": true, "batch_input_shape": [null, null, 768], "dtype": "float32", "filters": 768, "kernel_size": [25], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_14", "trainable": true, "dtype": "float32", "max_value": 20.0, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "Conv1D", "config": {"name": "conv1d_15", "trainable": true, "batch_input_shape": [null, null, 768], "dtype": "float32", "filters": 768, "kernel_size": [25], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_15", "trainable": true, "dtype": "float32", "max_value": 20.0, "negative_slope": 0.0, "threshold": 0.0}}]}}, {"class_name": "Sequential", "config": {"name": "sequential_6", "layers": [{"class_name": "Conv1D", "config": {"name": "conv1d_16", "trainable": true, "batch_input_shape": [null, null, 768], "dtype": "float32", "filters": 896, "kernel_size": [29], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [2], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_16", "trainable": true, "dtype": "float32", "max_value": 20.0, "negative_slope": 0.0, "threshold": 0.0}}]}}, {"class_name": "Sequential", "config": {"name": "sequential_7", "layers": [{"class_name": "Conv1D", "config": {"name": "conv1d_17", "trainable": true, "batch_input_shape": [null, null, 896], "dtype": "float32", "filters": 1024, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_17", "trainable": true, "dtype": "float32", "max_value": 20.0, "negative_slope": 0.0, "threshold": 0.0}}]}}, {"class_name": "Conv1D", "config": {"name": "conv1d_18", "trainable": true, "batch_input_shape": [null, null, 1024], "dtype": "float32", "filters": 29, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of102.bin", "group1-shard2of102.bin", "group1-shard3of102.bin", "group1-shard4of102.bin", "group1-shard5of102.bin", "group1-shard6of102.bin", "group1-shard7of102.bin", "group1-shard8of102.bin", "group1-shard9of102.bin", "group1-shard10of102.bin", "group1-shard11of102.bin", "group1-shard12of102.bin", "group1-shard13of102.bin", "group1-shard14of102.bin", "group1-shard15of102.bin", "group1-shard16of102.bin", "group1-shard17of102.bin", "group1-shard18of102.bin", "group1-shard19of102.bin", "group1-shard20of102.bin", "group1-shard21of102.bin", "group1-shard22of102.bin", "group1-shard23of102.bin", "group1-shard24of102.bin", "group1-shard25of102.bin", "group1-shard26of102.bin", "group1-shard27of102.bin", "group1-shard28of102.bin", "group1-shard29of102.bin", "group1-shard30of102.bin", "group1-shard31of102.bin", "group1-shard32of102.bin", "group1-shard33of102.bin", "group1-shard34of102.bin", "group1-shard35of102.bin", "group1-shard36of102.bin", "group1-shard37of102.bin", "group1-shard38of102.bin", "group1-shard39of102.bin", "group1-shard40of102.bin", "group1-shard41of102.bin", "group1-shard42of102.bin", "group1-shard43of102.bin", "group1-shard44of102.bin", "group1-shard45of102.bin", "group1-shard46of102.bin", "group1-shard47of102.bin", "group1-shard48of102.bin", "group1-shard49of102.bin", "group1-shard50of102.bin", "group1-shard51of102.bin", "group1-shard52of102.bin", "group1-shard53of102.bin", "group1-shard54of102.bin", "group1-shard55of102.bin", "group1-shard56of102.bin", "group1-shard57of102.bin", "group1-shard58of102.bin", "group1-shard59of102.bin", "group1-shard60of102.bin", "group1-shard61of102.bin", "group1-shard62of102.bin", "group1-shard63of102.bin", "group1-shard64of102.bin", "group1-shard65of102.bin", "group1-shard66of102.bin", "group1-shard67of102.bin", "group1-shard68of102.bin", "group1-shard69of102.bin", "group1-shard70of102.bin", "group1-shard71of102.bin", "group1-shard72of102.bin", "group1-shard73of102.bin", "group1-shard74of102.bin", "group1-shard75of102.bin", "group1-shard76of102.bin", "group1-shard77of102.bin", "group1-shard78of102.bin", "group1-shard79of102.bin", "group1-shard80of102.bin", "group1-shard81of102.bin", "group1-shard82of102.bin", "group1-shard83of102.bin", "group1-shard84of102.bin", "group1-shard85of102.bin", "group1-shard86of102.bin", "group1-shard87of102.bin", "group1-shard88of102.bin", "group1-shard89of102.bin", "group1-shard90of102.bin", "group1-shard91of102.bin", "group1-shard92of102.bin", "group1-shard93of102.bin", "group1-shard94of102.bin", "group1-shard95of102.bin", "group1-shard96of102.bin", "group1-shard97of102.bin", "group1-shard98of102.bin", "group1-shard99of102.bin", "group1-shard100of102.bin", "group1-shard101of102.bin", "group1-shard102of102.bin"], "weights": [{"name": "conv1d_18/kernel", "shape": [1, 1024, 29], "dtype": "float32"}, {"name": "conv1d_18/bias", "shape": [29], "dtype": "float32"}, {"name": "conv1d/kernel", "shape": [11, 64, 256], "dtype": "float32"}, {"name": "conv1d/bias", "shape": [256], "dtype": "float32"}, {"name": "conv1d_1/kernel", "shape": [11, 256, 256], "dtype": "float32"}, {"name": "conv1d_1/bias", "shape": [256], "dtype": "float32"}, {"name": "conv1d_2/kernel", "shape": [11, 256, 256], "dtype": "float32"}, {"name": "conv1d_2/bias", "shape": [256], "dtype": "float32"}, {"name": "conv1d_3/kernel", "shape": [11, 256, 256], "dtype": "float32"}, {"name": "conv1d_3/bias", "shape": [256], "dtype": "float32"}, {"name": "conv1d_4/kernel", "shape": [13, 256, 384], "dtype": "float32"}, {"name": "conv1d_4/bias", "shape": [384], "dtype": "float32"}, {"name": "conv1d_5/kernel", "shape": [13, 384, 384], "dtype": "float32"}, {"name": "conv1d_5/bias", "shape": [384], "dtype": "float32"}, {"name": "conv1d_6/kernel", "shape": [13, 384, 384], "dtype": "float32"}, {"name": "conv1d_6/bias", "shape": [384], "dtype": "float32"}, {"name": "conv1d_7/kernel", "shape": [17, 384, 512], "dtype": "float32"}, {"name": "conv1d_7/bias", "shape": [512], "dtype": "float32"}, {"name": "conv1d_8/kernel", "shape": [17, 512, 512], "dtype": "float32"}, {"name": "conv1d_8/bias", "shape": [512], "dtype": "float32"}, {"name": "conv1d_9/kernel", "shape": [17, 512, 512], "dtype": "float32"}, {"name": "conv1d_9/bias", "shape": [512], "dtype": "float32"}, {"name": "conv1d_10/kernel", "shape": [21, 512, 640], "dtype": "float32"}, {"name": "conv1d_10/bias", "shape": [640], "dtype": "float32"}, {"name": "conv1d_11/kernel", "shape": [21, 640, 640], "dtype": "float32"}, {"name": "conv1d_11/bias", "shape": [640], "dtype": "float32"}, {"name": "conv1d_12/kernel", "shape": [21, 640, 640], "dtype": "float32"}, {"name": "conv1d_12/bias", "shape": [640], "dtype": "float32"}, {"name": "conv1d_13/kernel", "shape": [25, 640, 768], "dtype": "float32"}, {"name": "conv1d_13/bias", "shape": [768], "dtype": "float32"}, {"name": "conv1d_14/kernel", "shape": [25, 768, 768], "dtype": "float32"}, {"name": "conv1d_14/bias", "shape": [768], "dtype": "float32"}, {"name": "conv1d_15/kernel", "shape": [25, 768, 768], "dtype": "float32"}, {"name": "conv1d_15/bias", "shape": [768], "dtype": "float32"}, {"name": "conv1d_16/kernel", "shape": [29, 768, 896], "dtype": "float32"}, {"name": "conv1d_16/bias", "shape": [896], "dtype": "float32"}, {"name": "conv1d_17/kernel", "shape": [1, 896, 1024], "dtype": "float32"}, {"name": "conv1d_17/bias", "shape": [1024], "dtype": "float32"}]}]}